tap "candid82/brew"
tap "d12frosted/emacs-plus"
tap "daviderestivo/emacs-head"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services", "https://gitee.com/cunkai/homebrew-services.git"
tap "laishulu/cask-fonts"
tap "laishulu/macism"
tap "markwu/personal"
tap "martido/graph"
tap "railwaycat/emacsmacport"
tap "terrastruct/d2"
tap "yqrashawn/goku"
brew "awk"
brew "chezmoi"
brew "doxygen"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "git-lfs"
brew "librsvg"
brew "graphviz"
brew "grex"
brew "helix"
brew "hunspell"
brew "imagemagick"
brew "jq"
brew "kakoune"
brew "mas"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "node"
brew "pandoc"
brew "php"
brew "ripgrep"
brew "ripgrep-all"
brew "spaceship"
brew "swiftplantuml"
brew "tag"
brew "thefuck"
brew "tldr"
brew "tree"
brew "universal-ctags", link: false
brew "wget"
brew "z.lua"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-dbus", "with-debug", "with-mailutils", "with-no-frame-refocus", "with-xwidgets"]
brew "felixkratz/formulae/svim"
brew "laishulu/macism/macism"
brew "markwu/personal/zeal", args: ["HEAD"]
brew "terrastruct/d2/d2"
brew "yqrashawn/goku/goku"
cask "activitywatch"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alfred"
cask "baidunetdisk"
cask "beekeeper-studio"
cask "calibre"
cask "cheatsheet"
cask "dbeaver-community"
cask "deepl"
cask "digikam"
cask "douyin"
cask "drawio"
cask "dteoh-devdocs"
cask "easyfind"
cask "firefox"
cask "font-lxgw-wenkai"
cask "font-noto-sans-mono"
cask "font-sarasa-nerd"
cask "free-download-manager"
cask "freeplane"
cask "geany"
cask "gephi"
cask "github"
cask "grammarly-desktop"
cask "grandperspective"
cask "hammerspoon"
cask "handbrake"
cask "iina"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "latest"
cask "libreoffice"
cask "little-snitch"
cask "logseq"
cask "lx-music"
cask "macupdater"
cask "macvim"
cask "mathpix-snipping-tool"
cask "meld"
cask "microsoft-edge"
cask "mpv"
cask "neovide"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "qlstephen"
cask "qspace-pro"
cask "showyedge"
cask "skim"
cask "sourcetree"
cask "sqlitestudio"
cask "squirrel"
cask "swiftplantumlapp"
cask "switchhosts"
cask "syntax-highlight"
cask "tencent-lemon"
cask "thunder"
cask "vimr"
cask "visual-studio-code"
cask "warp"
cask "wpsoffice-cn"
cask "yesplaymusic"
cask "zettlr"
mas "Agent A", id: 1446601134
mas "Amphetamine", id: 937984704
mas "Anybox", id: 1593408455
mas "Aqua Swatch", id: 1565479346
mas "BeMyEars", id: 1577662679
mas "BeyondPlayer Lite", id: 1444389594
mas "Billfish for Safari Extension", id: 1627430658
mas "Bitwarden", id: 1352778147
mas "Bob", id: 1630034110
mas "Carbo", id: 956811074
mas "CLOx Transcription", id: 1523222131
mas "Codeface", id: 1578175415
mas "Codye", id: 1516894961
mas "Color UI", id: 1092899208
mas "ColorSlurp", id: 1287239339
mas "CotEditor", id: 1024640650
mas "Cursor Pro", id: 1447043133
mas "CWS", id: 1598790017
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Day One", id: 1055511498
mas "Dependencies", id: 1538972026
mas "Desktop Pets", id: 1575542220
mas "Disk Graph", id: 697942581
mas "Drafts", id: 1435957248
mas "Evil Mineswifter", id: 1523249883
mas "Fig Player", id: 1612400976
mas "File Icons for GitHub and GitLab", id: 1631366167
mas "Fonts Ninja for Safari", id: 1480227114
mas "Foxmail", id: 617950461
mas "GeoGebra Calculator Suite", id: 1504416652
mas "GoodNotes", id: 1444383602
mas "Grammar Check", id: 1632607331
mas "Grammarly for Safari", id: 1462114288
mas "HazeOver", id: 430798174
mas "Hex Fiend", id: 1342896380
mas "iBar", id: 6443843900
mas "iMovie 剪辑", id: 408981434
mas "Infuse", id: 1136220934
mas "Internet Access Policy Viewer", id: 1482630322
mas "iStat Menus", id: 1319778037
mas "iyingyue", id: 1050489667
mas "Just Press Record", id: 1033342465
mas "Keka", id: 470158793
mas "Keymou", id: 449863619
mas "Keynote 讲演", id: 409183694
mas "Kuar", id: 1553562554
mas "LanguageTool", id: 1534275760
mas "LightNote", id: 1546030973
mas "Liquid", id: 569048352
mas "Magnet Links", id: 1598258908
mas "MarginNote 3", id: 1423522373
mas "Marklist", id: 1218171533
mas "MathStudio", id: 829912893
mas "Micro Snitch", id: 972028355
mas "Mockview", id: 1592728145
mas "Moom", id: 419330170
mas "Moped", id: 1477419086
mas "MWeb Pro", id: 1403919533
mas "Notability", id: 360593530
mas "Numbers 表格", id: 409203825
mas "Octotree", id: 1457450145
mas "OneTab", id: 1540160809
mas "OwlOCR", id: 1499181666
mas "Pages 文稿", id: 409201541
mas "PD", id: 510365488
mas "PDF Viewer", id: 1120099014
mas "PiPifier", id: 1160374471
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "PopClip", id: 445189367
mas "Qmenu", id: 1567442612
mas "QQ", id: 451108668
mas "QSpace", id: 1469774098
mas "Redacted", id: 984968384
mas "Refined GitHub", id: 1519867270
mas "Regex for Safari", id: 1597580456
mas "RegEx Lab", id: 1252988123
mas "ScreenToLayers", id: 1077317077
mas "Sequel Ace", id: 1518036000
mas "Shazam", id: 897118787
mas "SnippetsLab", id: 1006087419
mas "SQLiteExplorer", id: 1616792360
mas "SubEthaEdit", id: 728530824
mas "Tampermonkey", id: 1482490089
mas "TestFlight", id: 899247664
mas "Time Sink", id: 404363161
mas "ToMenu", id: 1414457383
mas "Transcribe", id: 1602959841
mas "Twitter", id: 1482454543
mas "V2exOS", id: 6443544914
mas "Valentina Studio", id: 604825918
mas "Vectorize!", id: 1520204499
mas "Vectornator", id: 1219074514
mas "Vimkey", id: 1585682577
mas "Vimlike", id: 1584519802
mas "VoiceExpress", id: 1434634466
mas "Wappalyzer", id: 1520333300
mas "Wayback Machine", id: 1472432422
mas "Web Translator", id: 6443492610
mas "X to Y", id: 1598259546
mas "X-Reader", id: 1476139856
mas "xSearch", id: 1579902068
mas "剪映专业版", id: 1529999940
mas "听阅", id: 645926554
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "欧路词典", id: 402380914
mas "生词本", id: 1120027237
mas "白描", id: 1249901692
mas "自动切换输入法 专业版", id: 1551531632
